from colorama import Fore, init
from chatbot import get_response

init(autoreset=True)

banner = Fore.RED + r"""
 ██████╗██╗   ██╗██████╗ ███████╗██████╗ ████████╗███████╗██████╗ ███╗   ███╗
██╔════╝╚██╗ ██╔╝██╔══██╗██╔════╝██╔══██╗╚══██╔══╝██╔════╝██╔══██╗████╗ ████║
██║      ╚████╔╝ ██████╔╝█████╗  ██████╔╝   ██║   █████╗  ██████╔╝██╔████╔██║
██║       ╚██╔╝  ██╔══██╗██╔══╝  ██╔══██╗   ██║   ██╔══╝  ██╔══██╗██║╚██╔╝██║
╚██████╗   ██║   ██████╔╝███████╗██║  ██║   ██║   ███████╗██║  ██║██║ ╚═╝ ██║
 ╚═════╝   ╚═╝   ╚═════╝ ╚══════╝╚═╝  ╚═╝   ╚═╝   ╚══════╝╚═╝  ╚═╝╚═╝     ╚═╝

            CyberTerm AI - Terminal Cybersecurity Assistant
            Developed by Yashraj (@yashrajhere)
"""

print(banner)

print("Type 'help' to see commands.\n")

while True:
    user_input = input("[User] > ").lower()

    if user_input in ["exit", "quit"]:
        print("[CyberAI] > Goodbye! Stay secure.")
        break

    if user_input == "clear":
        os.system("cls" if os.name == "nt" else "clear")
        print(banner)
        continue

    response = get_response(user_input)
    print("[CyberAI] >", response)
